Documents/Табель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Табель</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть1</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День3</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День4</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День5</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День6</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День7</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День8</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День9</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День10</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День11</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День12</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День13</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День14</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День15</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День16</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День17</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День18</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День19</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День20</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День21</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День22</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День23</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День24</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День25</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День26</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День27</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День28</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День29</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День30</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День31</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОтработаныхДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Табель/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТабличнаяЧасть1День1ПриИзменении(Элемент) 
	
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День1 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1); 
	
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День2ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День2 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День3ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День3 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День4ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День4 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День5ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День5 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День6ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День6 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День7ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День7 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День8ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День8 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День9ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День9 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День10ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День10 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День11ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День11 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День12ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День12 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День13ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День13 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День14ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День14 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День15ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День15 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День16ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День16 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День17ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День17 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День18ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День18 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День19ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День19 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День20ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День20 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День21ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День21 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День22ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День22 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День23ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День23 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День24ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День24 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День25ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День25 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День26ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День26 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День27ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День27 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День28ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День28 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День29ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День29 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День30ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День30 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1День31ПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	СтрокаТЧ.КоличествоОтработаныхДней = ?(СтрокаТЧ.День31 = Истина,СтрокаТЧ.КоличествоОтработаныхДней + 1,СтрокаТЧ.КоличествоОтработаныхДней - 1);
КонецПроцедуры
